In [92]:
print("hello")

hello

In [93]:
print("hello world")

hello world

In [94]:
import numpy as np 
arr1 = np.array([1,2,3,4,5,6,6,7,0])

arr1

array([1, 2, 3, 4, 5, 6, 6, 7, 0])

import pandas as pd


entries = {
    'maths':[50,45,30,45,40],
    'science':[45,50,40,30,20]
}

In [95]:
df1 = pd.DataFrame(entries)

In [96]:
df1

   maths  science
0     50       45
1     45       50
2     30       40
3     45       30
4     40       20

In [97]:
import pandas as pd

In [98]:
entries = {
    'maths':[50,45,30,45,40],
    'science':[45,50,40,30,20]
}

In [99]:
df1 = pd.DataFrame(entries)

In [100]:
df1

   maths  science
0     50       45
1     45       50
2     30       40
3     45       30
4     40       20

In [101]:
df1['maths']

0    50
1    45
2    30
3    45
4    40
Name: maths, dtype: int64

In [102]:
df1.loc[0]

maths      50
science    45
Name: 0, dtype: int64

In [103]:
df1[df1['maths'] > 40]['maths']

0    50
1    45
3    45
Name: maths, dtype: int64

In [104]:
df1[(df1['maths'] > 40) & (df1['science'] > 30)]

   maths  science
0     50       45
1     45       50

In [105]:
df1

   maths  science
0     50       45
1     45       50
2     30       40
3     45       30
4     40       20

In [106]:
entries2 = {
    'maths':[40,35,50,35,30],
    'science':[15,30,30,20,25]
}

In [107]:
df2 = pd.DataFrame(entries2)

In [108]:
df2

   maths  science
0     40       15
1     35       30
2     50       30
3     35       20
4     30       25

In [109]:
df3 = pd.concat([df1,df2])

In [110]:
df3

   maths  science
0     50       45
1     45       50
2     30       40
3     45       30
4     40       20
0     40       15
1     35       30
2     50       30
3     35       20
4     30       25

In [111]:
df3 = df3.reset_index()

In [112]:
df3

   index  maths  science
0      0     50       45
1      1     45       50
2      2     30       40
3      3     45       30
4      4     40       20
5      0     40       15
6      1     35       30
7      2     50       30
8      3     35       20
9      4     30       25

In [113]:
def add_maths_science(row):
    return row['maths'] + row['science']

In [114]:
df3['total'] = df3.apply(add_maths_science,axis=1)

In [115]:
df3

   index  maths  science  total
0      0     50       45     95
1      1     45       50     95
2      2     30       40     70
3      3     45       30     75
4      4     40       20     60
5      0     40       15     55
6      1     35       30     65
7      2     50       30     80
8      3     35       20     55
9      4     30       25     55

In [116]:
df3

   index  maths  science  total
0      0     50       45     95
1      1     45       50     95
2      2     30       40     70
3      3     45       30     75
4      4     40       20     60
5      0     40       15     55
6      1     35       30     65
7      2     50       30     80
8      3     35       20     55
9      4     30       25     55

In [117]:
df4 = pd.DataFrame(entries2)

In [118]:
df4

   maths  science
0     40       15
1     35       30
2     50       30
3     35       20
4     30       25

In [119]:
entries3 = {
'maths':[50,None],
    'science':[45,55]
}

In [120]:
df4 = pd.DataFrame(entries3)

In [121]:
df4

   maths  science
0   50.0       45
1    NaN       55

In [122]:
df6 =df4.fillna(0)

df6

In [124]:
df3.to_csv('class.csv')